{
  "clinical_notes": [
    {
      "id": 1,
      "patient_id": "PT001",
      "date": "2024-01-15",
      "note": "58-year-old male presents with chest pain and shortness of breath. Vitals: BP 145/92, HR 88, RR 18. EKG shows no acute changes. Patient history of hypertension and type 2 diabetes. Started on aspirin and nitroglycerin. Referred to cardiology for further evaluation.",
      "conditions": ["chest pain", "hypertension", "type 2 diabetes"],
      "procedures": ["EKG"],
      "medications": ["aspirin", "nitroglycerin"]
    },
    {
      "id": 2,
      "patient_id": "PT002",
      "date": "2024-01-16",
      "note": "42-year-old female with acute upper respiratory infection. Fever (102.3°F), cough, and sore throat. Rapid strep test positive. Prescribed amoxicillin 500mg three times daily. Advised to rest and increase fluid intake. Follow-up in 1 week if symptoms persist.",
      "conditions": ["upper respiratory infection", "pharyngitis", "fever"],
      "procedures": ["rapid strep test"],
      "medications": ["amoxicillin"]
    },
    {
      "id": 3,
      "patient_id": "PT003",
      "date": "2024-01-17",
      "note": "67-year-old male with hip pain following fall. X-ray reveals subcapital femoral neck fracture. Patient seen by orthopedic surgery. Recommended total hip arthroplasty. Pre-operative clearance obtained. Surgery scheduled for next week.",
      "conditions": ["hip fracture", "post-trauma pain"],
      "procedures": ["X-ray", "orthopedic consultation"],
      "medications": ["morphine", "acetaminophen"]
    },
    {
      "id": 4,
      "patient_id": "PT004",
      "date": "2024-01-18",
      "note": "35-year-old female with migraine and nausea. No visual aura. No neurological deficits. Blood pressure normal. Prescribed sumatriptan for acute relief and propranolol for prophylaxis. Recommended lifestyle modifications including regular sleep and stress reduction.",
      "conditions": ["migraine without aura"],
      "procedures": ["neurological exam"],
      "medications": ["sumatriptan", "propranolol"]
    },
    {
      "id": 5,
      "patient_id": "PT005",
      "date": "2024-01-19",
      "note": "72-year-old male with type 2 diabetes presenting for routine follow-up. HbA1c 7.2% (within target). BP 138/85. Urine microalbumin normal. Advised to continue current medications. Scheduled for annual eye exam and foot screening.",
      "conditions": ["type 2 diabetes"],
      "procedures": ["HbA1c testing", "urinalysis"],
      "medications": ["metformin", "lisinopril"]
    }
  ]
}
